Xinyuan-LilyGO/lilygo-micropython/target/esp32/boards/LILYGO_T-SIM7000G/mpconfigboard.h
#define MICROPY_HW_BOARD_NAME "T-SIM7000G (spiram)"
#define MICROPY_HW_MCU_NAME "ESP32"